app/views/sessions/new.html.erb

SELECT COUNT(*) FROM "user_logins"
SELECT COUNT(*) FROM "roles"
---
  <% registered = UserLogin.count %>
  <% role_count = Role.count %>

INSERT INTO "roles" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Administrator"], ["description", "Person who administers the entire System"], ["created_at", "2018-11-22 03:05:10.102877"], ["updated_at", "2018-11-22 03:05:10.102877"]]
INSERT INTO "roles" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Supervisor"], ["description", "Person who oversees the department assigned"], ["created_at", "2018-11-22 03:05:10.138331"], ["updated_at", "2018-11-22 03:05:10.138331"]]
---
    <p>registered = <%= registered %></p>
    <% Role.create(:name => "Administrator", :description => "Person who administers the entire System") %>
    <% Role.create(:name => "Supervisor", :description => "Person who oversees the department assigned") %>