app/views/users/_form.html.erb

    <%= form.label "designation" %>
    <%= form.collection_select(:role_id, Role.all, :id, :name, :prompt => 'Select Role') %>
---
SELECT "roles".* FROM "roles"

    <%= form.label :user_id %>
    <%= form.collection_select(:user_id, User.all, :id, :fname, :prompt => 'Specify Supervisor') %>
---
SELECT "users".* FROM "users"

    <%= form.label :department_id %>
    <%= form.collection_select(:department_id, Department.all, :id, :name, :prompt => 'Specify Department') %>
---
SELECT "departments".* FROM "departments"