app/views/users/_new.html.erb


		  <% registered = UserLogin.count %>
		  <% role_count = Role.count %>
---
SELECT COUNT(*) FROM "user_logins"
SELECT "roles".* FROM "roles"
SELECT COUNT(*) FROM "roles"

		    <p>registered = <%= registered %></p>
		    <% Role.create(:name => "Administrator", :description => "Person who administers the entire System") %>
		    <% Role.create(:name => "Supervisor", :description => "Person who oversees the department assigned") %>
		    <% Department.create(:name => "Human Resource Unit") %>
		    <% Department.create(:name => "Administrative Unit") %>
		    <% Department.create(:name => "Finance Unit") %>
		    <% Department.create(:name => "Technical Unit") %>
---
INSERT INTO "roles" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Administrator"], ["description", "Person who administers the entire System"], ["created_at", "2018-11-23 12:51:31.889036"], ["updated_at", "2018-11-23 12:51:31.889036"]]
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Human Resource Unit"], ["created_at", "2018-11-23 12:51:32.218459"], ["updated_at", "2018-11-23 12:51:32.218459"]]
INSERT INTO "roles" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Supervisor"], ["description", "Person who oversees the department assigned"], ["created_at", "2018-11-23 12:51:32.138089"], ["updated_at", "2018-11-23 12:51:32.138089"]]
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Administrative Unit"], ["created_at", "2018-11-23 12:51:32.319096"], ["updated_at", "2018-11-23 12:51:32.319096"]]
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Administrative Unit"], ["created_at", "2018-11-23 12:51:32.348400"], ["updated_at", "2018-11-23 12:51:32.348400"]]
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Administrative Unit"], ["created_at", "2018-11-23 12:51:32.394113"], ["updated_at", "2018-11-23 12:51:32.394113"]]

		    <%= form.label "designation" %>
		    <%= form.collection_select(:role_id, Role.all, :id, :name, :prompt => 'Select Role') %>
---
SELECT "roles".* FROM "roles"

		    <%= form.label :user_id %>
		    <%= form.collection_select(:user_id, User.all, :id, :fname, :prompt => 'Specify Supervisor') %>
---
SELECT "users".* FROM "users"

		    <%= form.label :department_id %>
		    <%= form.collection_select(:department_id, Department.all, :id, :name, :prompt => 'Specify Department') %>
---
SELECT "departments".* FROM "departments"