app/views/users/index.html.erb

SELECT "roles"."name" FROM "roles" WHERE (id = NULL)
SELECT "users"."lname" FROM "users" WHERE (id = NULL)
SELECT "departments"."name" FROM "departments" WHERE (id = NULL)
---

        <td><%= Role.where("id = ?", user.role_id).pluck(:name).first %></td>
        <td><%= User.where("id = ?", user.user_id).pluck(:fname).first.to_s + " " + User.where("id = ?", user.user_id).pluck(:lname).first.to_s %></td>
        <td><%= Department.where("id = ?", user.department_id).pluck(:name).first %></td>