app/views/departments/_form.html.erb

    <div class="col-sm-10">
    <%= form.collection_select(:user_id, User.all, :id, :fname_with_lname, { :prompt => 'Specify Head of Department' } , { :class => "form-control" }) %>
---
SELECT "users".* FROM "users"