app/views/departments/_show.html.erb

    <div class="col-sm-9">
      <%= form.collection_select(:user_id, User.all, :id, :fname, { :prompt => 'Specify Head of Department' }, {class: 'form-control' }) %>
---
SELECT "users".* FROM "users"