app/views/departments/index.html.erb

SELECT "users"."lname" FROM "users" WHERE (id = 1)
---
        <td><%= department.name %></td>
        <td><%= User.where("id = ?", department.user_id).pluck(:fname).first.to_s + " " + User.where("id = ?", department.user_id).pluck(:lname).first.to_s %></td>