app/views/departments/show.html.erb

SELECT "users"."lname" FROM "users" WHERE (id = 1)
---
  <strong>Head of Department:</strong>
  <td><%= User.where("id = ?", @department.user_id).pluck(:fname).first.to_s + " " + User.where("id = ?", @department.user_id).pluck(:lname).first.to_s %></td>