app/controllers/departments_controller.rb

  def retriever
    department_id = params[:department_id]
    # do something with some_parameter and return the results

    @dept_head=Department.where("id = ?", department_id).pluck(:name).first
---
SELECT "departments"."name" FROM "departments" WHERE (id = '4')

  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "HR Department"], ["created_at", "2018-11-13 14:00:24.046016"], ["updated_at", "2018-11-13 14:00:24.046016"]]

  def update
    respond_to do |format|
      if @department.update(department_params)
---
UPDATE "departments" SET "user_id" = ?, "updated_at" = ? WHERE "departments"."id" = ?  [["user_id", 1], ["updated_at", "2018-11-27 03:09:53.261207"], ["id", 1]]

  def destroy
    @department.destroy
---
DELETE FROM "departments" WHERE "departments"."id" = ?  [["id", 2]]