app/controllers/documents_controller.rb

SELECT  "documents".* FROM "documents" WHERE (subject LIKE '%%') ORDER BY "documents"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "documents" WHERE (subject LIKE '%%')
SELECT  "documents".* FROM "documents" ORDER BY "documents"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "documents"
---
  def index
    #@documents = Document.all.paginate(:page => params[:page], :per_page => 5)
    @documents = if params[:subject]
      Document.where('subject LIKE ?', "%#{params[:subject]}%").order('id DESC').paginate(:page => params[:page], :per_page => 5)
    else
      Document.all.order('id DESC').paginate(:page => params[:page], :per_page => 5)

INSERT INTO "documents" ("subject", "status", "date_created", "time_created", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save

UPDATE "documents" SET "subject" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["subject", "Surat para sa gabos"], ["updated_at", "2018-11-27 06:14:38.447211"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @document.update(document_params)

DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 4]]
---
  def destroy
    @document.destroy