app/controllers/roles_controller.rb

  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "bisor"], ["description", "bisor kuno"], ["created_at", "2018-11-13 14:27:39.199579"], ["updated_at", "2018-11-13 14:27:39.199579"]]