app/controllers/sessions_controller.rb

  def create
  	user = User.find_by_username(params[:username])
  	if user && user.authenticate(params[:password])
    	session[:user_id] = user.id
      @date = DateTime.current
      UserLogin.create(:timestamp => @date, :user_id => session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "admin"], ["LIMIT", 1]]
INSERT INTO "user_logins" ("timestamp", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["timestamp", "2018-11-13 13:54:01.785930"], ["user_id", 1], ["created_at", "2018-11-13 13:54:03.119132"], ["updated_at", "2018-11-13 13:54:03.119132"]]