app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
        #session[:user_id] = @user.id
        #format.html { redirect_back(fallback_location: root_path), notice: 'Thank you for signing up!' }
        user = User.find(@user.id)
---
INSERT INTO "users" ("username", "fname", "lname", "email", "password_digest", "role_id", "user_id", "created_at", "updated_at", "department_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @user.update(user_params)
        user = User.find(@user.id)
---
UPDATE "users" SET "fname" = ?, "lname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["fname", "Alexander once upon a time"], ["lname", "alalaalalalalalall wew sapnu puas"], ["updated_at", "2018-11-27 03:26:37.906462"], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]